In [10]:
import numpy as np
import pandas as pd

In [11]:
notas = pd.Series([1,2,3,4])
print(notas)
print(notas.values)
print(notas.index)

0    1
1    2
2    3
3    4
dtype: int64
[1 2 3 4]
RangeIndex(start=0, stop=4, step=1)

In [12]:
notas = pd.Series([2,7,5,10,6], index=["Wilfred", "Abbie", "Harry", "Julia", "Carrie"])
notas

Wilfred     2
Abbie       7
Harry       5
Julia      10
Carrie      6
dtype: int64

In [13]:
print("media", notas.mean())
print("desvio padrao", notas.std())
notas.describe()

media 6.0
desvio padrao 2.9154759474226504

count     5.000000
mean      6.000000
std       2.915476
min       2.000000
25%       5.000000
50%       6.000000
75%       7.000000
max      10.000000
dtype: float64

In [14]:
notas**2

Wilfred      4
Abbie       49
Harry       25
Julia      100
Carrie      36
dtype: int64

In [15]:
np.log(notas)

Wilfred    0.693147
Abbie      1.945910
Harry      1.609438
Julia      2.302585
Carrie     1.791759
dtype: float64

In [16]:
df = pd.DataFrame({'Aluno' : ["Wilfred", "Abbie", "Harry", "Julia", "Carrie"],
                   'Faltas' : [3,4,2,1,4],
                   'Prova' : [2,7,5,10,6],
                   'Seminário': [8.5,7.5,9.0,7.5,8.0]})
df.head()

     Aluno  Faltas  Prova  Seminário
0  Wilfred       3      2        8.5
1    Abbie       4      7        7.5
2    Harry       2      5        9.0
3    Julia       1     10        7.5
4   Carrie       4      6        8.0

In [17]:
df.dtypes

Aluno         object
Faltas         int64
Prova          int64
Seminário    float64
dtype: object

In [18]:
df.columns

Index(['Aluno', 'Faltas', 'Prova', 'Seminário'], dtype='object')

In [19]:
df["Seminário"]

0    8.5
1    7.5
2    9.0
3    7.5
4    8.0
Name: Seminário, dtype: float64

In [20]:
df.describe()

        Faltas      Prova  Seminário
count  5.00000   5.000000    5.00000
mean   2.80000   6.000000    8.10000
std    1.30384   2.915476    0.65192
min    1.00000   2.000000    7.50000
25%    2.00000   5.000000    7.50000
50%    3.00000   6.000000    8.00000
75%    4.00000   7.000000    8.50000
max    4.00000  10.000000    9.00000

In [21]:
df.sort_values(by="Seminário")

     Aluno  Faltas  Prova  Seminário
1    Abbie       4      7        7.5
3    Julia       1     10        7.5
4   Carrie       4      6        8.0
0  Wilfred       3      2        8.5
2    Harry       2      5        9.0

In [22]:
df.loc[3]

Aluno        Julia
Faltas           1
Prova           10
Seminário      7.5
Name: 3, dtype: object

In [23]:
df[df["Seminário"] > 8.0]

     Aluno  Faltas  Prova  Seminário
0  Wilfred       3      2        8.5
2    Harry       2      5        9.0

In [25]:
df[(df["Seminário"] > 8.0) & (df["Prova"] > 3)]

   Aluno  Faltas  Prova  Seminário
2  Harry       2      5        9.0

In [26]:
df.tail()

     Aluno  Faltas  Prova  Seminário
0  Wilfred       3      2        8.5
1    Abbie       4      7        7.5
2    Harry       2      5        9.0
3    Julia       1     10        7.5
4   Carrie       4      6        8.0

In [28]:
df["Seminário"].unique()

array([8.5, 7.5, 9. , 8. ])

In [30]:
df

     Aluno  Faltas  Prova  Seminário
0  Wilfred       3      2        8.5
1    Abbie       4      7        7.5
2    Harry       2      5        9.0
3    Julia       1     10        7.5
4   Carrie       4      6        8.0

In [29]:
df["Faltas"].value_counts()

4    2
3    1
2    1
1    1
Name: Faltas, dtype: int64

In [32]:
df["Faltas"].value_counts(normalize=True)

4    0.4
3    0.2
2    0.2
1    0.2
Name: Faltas, dtype: float64

In [33]:
df.groupby("Faltas").mean()

        Prova  Seminário
Faltas
1        10.0       7.50
2         5.0       9.00
3         2.0       8.50
4         6.5       7.75

In [34]:
df["Aluno"].apply(lambda x: x[:3])

0    Wil
1    Abb
2    Har
3    Jul
4    Car
Name: Aluno, dtype: object

In [35]:
df = pd.DataFrame({'Aluno' : ["Wilfred", "Abbie", "Harry", "Julia", "Carrie"],
                   'Faltas' : [3,4,2,1,4],
                   'Prova' : [2,7,5,10,6],
                   'Seminário': [8.5,7.5,9.0,7.5,8.0]})
df.to_csv("aulas.csv")
pd.read_csv("aulas.csv")

   Unnamed: 0    Aluno  Faltas  Prova  Seminário
0           0  Wilfred       3      2        8.5
1           1    Abbie       4      7        7.5
2           2    Harry       2      5        9.0
3           3    Julia       1     10        7.5
4           4   Carrie       4      6        8.0